In [6]:
import pandas as pd
import numpy as np

In [7]:
# creating pandas Series
first_series = pd.Series(list('abcdef'))
first_series

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [8]:
list('abhishek')

['a', 'b', 'h', 'i', 's', 'h', 'e', 'k']

In [9]:
# creating pandas series using ndarry
np_countries = np.array(['India','Pakistan','Nepal','Bhutan','Bangladesh','Philippines','Australia'])
s_countries = pd.Series(np_countries)
s_countries

0          India
1       Pakistan
2          Nepal
3         Bhutan
4     Bangladesh
5    Philippines
6      Australia
dtype: object

In [10]:
# creating pandas series using dictionary
dict_country_gdp = pd.Series([34534,5657567,45345,34545,234,45435], index =['India','Australia','Canada','Pakistan','Bhutan','Bankgladesh'])
dict_country_gdp

India            34534
Australia      5657567
Canada           45345
Pakistan         34545
Bhutan             234
Bankgladesh      45435
dtype: int64

In [11]:
# creating pandas series using scalar value
scalar_series = pd.Series(5., index = ['a', 'b', 'c', 'd','e'])
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [12]:
dict_country_gdp['India']

34534

In [13]:
dict_country_gdp[2:4]

Canada      45345
Pakistan    34545
dtype: int64

In [14]:
dict_country_gdp.iloc[0]

34534

In [15]:
dict_country_gdp.loc['Bhutan']

234

In [16]:
data_dict = {"India":{2012:205},"London":{2008:300}}

In [17]:
type(data_dict)

dict

In [18]:
# creating a dataframe using the dictionary data_dict
df_data_dict = pd.DataFrame(data_dict)
df_data_dict

      India  London
2012  205.0     NaN
2008    NaN   300.0

In [19]:
olympic_series_participation = pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
olympic_series_cities = pd.Series(['London','Paris','Berlin','New Delhi','New York'], index=[2012,2008,2004,2000,1996])

In [20]:
df_olympic = pd.DataFrame({"Number of Participating Counties":olympic_series_participation,"Host Cities":olympic_series_cities})

In [21]:
df_olympic.describe

<bound method NDFrame.describe of       Number of Participating Counties Host Cities
2012                               205      London
2008                               204       Paris
2004                               201      Berlin
2000                               200   New Delhi
1996                               197    New York>

In [22]:
df_olympic

      Number of Participating Counties Host Cities
2012                               205      London
2008                               204       Paris
2004                               201      Berlin
2000                               200   New Delhi
1996                               197    New York

In [23]:
df_olympic.describe()

       Number of Participating Counties
count                          5.000000
mean                         201.400000
std                            3.209361
min                          197.000000
25%                          200.000000
50%                          201.000000
75%                          204.000000
max                          205.000000

In [24]:
df_movie_rating = pd.DataFrame({"Movie1":[5,2,4,4,5,2,1,5], "Movie2":[3,1,5,4,5,4,1,5]}, index=['User1','User2','User3','User4','User5','User6','User7','User8'])
df_movie_rating

       Movie1  Movie2
User1       5       3
User2       2       1
User3       4       5
User4       4       4
User5       5       5
User6       2       4
User7       1       1
User8       5       5

In [28]:
# selecting just one column is fetching index also automatically :)
df_movie1 = df_movie_rating["Movie1"]
df_movie1["User1"]
df_movie_rating.Movie1

User1    5
User2    2
User3    4
User4    4
User5    5
User6    2
User7    1
User8    5
Name: Movie1, dtype: int64

In [36]:
def maprating(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    if rating == 2:
        return 'D'
    if rating == 1:
        return 'F'  # F means failed the expectations :)

In [39]:
# applying a function to the entire dataframe in one line, using apply and applymap functions
df_movie_rating.applymap(maprating)

      Movie1 Movie2
User1      A      C
User2      D      F
User3      B      A
User4      B      B
User5      A      A
User6      D      B
User7      F      F
User8      A      A

In [33]:
# Grouping by first name
df_student_name = pd.DataFrame({'first':['sim','tim','kim','sim'], 'last':['khan','jones','cruise','paul']})

In [30]:
df_student_name

  first    last
0   sim    khan
1   tim   jones
2   kim  cruise
3   sim    paul

In [32]:
grouped = df_student_name.groupby('first')
grouped.get_group('sim')

  first  last
0   sim  khan
3   sim  paul